; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person city flevel - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (nxt ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (nxt ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (nxt ?l2 ?l1)
		 (nxt ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (nxt ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-5-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city5)
	(fuel-level plane1 fl2)
	(at plane2 city2)
	(fuel-level plane2 fl6)
	(at plane3 city4)
	(fuel-level plane3 fl6)
	(at plane4 city8)
	(fuel-level plane4 fl3)
	(at plane5 city9)
	(fuel-level plane5 fl4)
	(at person1 city9)
	(at person2 city1)
	(at person3 city0)
	(at person4 city9)
	(at person5 city6)
	(at person6 city0)
	(at person7 city7)
	(at person8 city6)
	(at person9 city4)
	(at person10 city7)
	(nxt fl0 fl1)
	(nxt fl1 fl2)
	(nxt fl2 fl3)
	(nxt fl3 fl4)
	(nxt fl4 fl5)
	(nxt fl5 fl6)
)
(:goal (and
	(at plane2 city3)
	(at plane4 city5)
	(at plane5 city8)
	(at person2 city8)
	(at person3 city2)
	(at person4 city7)
	(at person5 city1)
	(at person6 city6)
	(at person7 city5)
	(at person8 city1)
	(at person9 city5)
	(at person10 city9)
	))

)

; plan
1. (fly plane4 city8 city4 fl3 fl2)
   deleted: (at plane4 city8) (fuel-level plane4 fl3)
   added: (at plane4 city4) (fuel-level plane4 fl2)
   goals met: 0 of 12
2. (board person9 plane4 city4)
   deleted: (at person9 city4)
   added: (in person9 plane4)
   goals met: 0 of 12
3. (fly plane4 city4 city5 fl2 fl1)
   deleted: (at plane4 city4) (fuel-level plane4 fl2)
   added: (at plane4 city5) (fuel-level plane4 fl1)
   goals met: 1 of 12
4. (debark person9 plane4 city5)
   deleted: (in person9 plane4)
   added: (at person9 city5)
   goals met: 2 of 12
5. (fly plane2 city2 city3 fl6 fl5)
   deleted: (at plane2 city2) (fuel-level plane2 fl6)
   added: (at plane2 city3) (fuel-level plane2 fl5)
   goals met: 3 of 12
6. (board person4 plane5 city9)
   deleted: (at person4 city9)
   added: (in person4 plane5)
   goals met: 3 of 12
7. (fly plane1 city5 city0 fl2 fl1)
   deleted: (at plane1 city5) (fuel-level plane1 fl2)
   added: (at plane1 city0) (fuel-level plane1 fl1)
   goals met: 3 of 12
8. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   goals met: 3 of 12
9. (fly plane1 city0 city2 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 3 of 12
10. (debark person3 plane1 city2)
   deleted: (in person3 plane1)
   added: (at person3 city2)
   goals met: 4 of 12
11. (fly plane3 city4 city0 fl6 fl5)
   deleted: (at plane3 city4) (fuel-level plane3 fl6)
   added: (at plane3 city0) (fuel-level plane3 fl5)
   goals met: 4 of 12
12. (board person6 plane3 city0)
   deleted: (at person6 city0)
   added: (in person6 plane3)
   goals met: 4 of 12
13. (fly plane3 city0 city1 fl5 fl4)
   deleted: (at plane3 city0) (fuel-level plane3 fl5)
   added: (at plane3 city1) (fuel-level plane3 fl4)
   goals met: 4 of 12
14. (board person2 plane3 city1)
   deleted: (at person2 city1)
   added: (in person2 plane3)
   goals met: 4 of 12
15. (fly plane3 city1 city6 fl4 fl3)
   deleted: (at plane3 city1) (fuel-level plane3 fl4)
   added: (at plane3 city6) (fuel-level plane3 fl3)
   goals met: 4 of 12
16. (board person5 plane3 city6)
   deleted: (at person5 city6)
   added: (in person5 plane3)
   goals met: 4 of 12
17. (board person8 plane3 city6)
   deleted: (at person8 city6)
   added: (in person8 plane3)
   goals met: 4 of 12
18. (debark person6 plane3 city6)
   deleted: (in person6 plane3)
   added: (at person6 city6)
   goals met: 5 of 12
19. (fly plane3 city6 city1 fl3 fl2)
   deleted: (at plane3 city6) (fuel-level plane3 fl3)
   added: (at plane3 city1) (fuel-level plane3 fl2)
   goals met: 5 of 12
20. (debark person5 plane3 city1)
   deleted: (in person5 plane3)
   added: (at person5 city1)
   goals met: 6 of 12
21. (debark person8 plane3 city1)
   deleted: (in person8 plane3)
   added: (at person8 city1)
   goals met: 7 of 12
22. (fly plane3 city1 city8 fl2 fl1)
   deleted: (at plane3 city1) (fuel-level plane3 fl2)
   added: (at plane3 city8) (fuel-level plane3 fl1)
   goals met: 7 of 12
23. (debark person2 plane3 city8)
   deleted: (in person2 plane3)
   added: (at person2 city8)
   goals met: 8 of 12
24. (fly plane5 city9 city7 fl4 fl3)
   deleted: (at plane5 city9) (fuel-level plane5 fl4)
   added: (at plane5 city7) (fuel-level plane5 fl3)
   goals met: 8 of 12
25. (board person7 plane5 city7)
   deleted: (at person7 city7)
   added: (in person7 plane5)
   goals met: 8 of 12
26. (board person10 plane5 city7)
   deleted: (at person10 city7)
   added: (in person10 plane5)
   goals met: 8 of 12
27. (debark person4 plane5 city7)
   deleted: (in person4 plane5)
   added: (at person4 city7)
   goals met: 9 of 12
28. (fly plane5 city7 city5 fl3 fl2)
   deleted: (at plane5 city7) (fuel-level plane5 fl3)
   added: (at plane5 city5) (fuel-level plane5 fl2)
   goals met: 9 of 12
29. (debark person7 plane5 city5)
   deleted: (in person7 plane5)
   added: (at person7 city5)
   goals met: 10 of 12
30. (fly plane5 city5 city9 fl2 fl1)
   deleted: (at plane5 city5) (fuel-level plane5 fl2)
   added: (at plane5 city9) (fuel-level plane5 fl1)
   goals met: 10 of 12
31. (debark person10 plane5 city9)
   deleted: (in person10 plane5)
   added: (at person10 city9)
   goals met: 11 of 12
32. (fly plane5 city9 city8 fl1 fl0)
   deleted: (at plane5 city9) (fuel-level plane5 fl1)
   added: (at plane5 city8) (fuel-level plane5 fl0)
   goals met: 12 of 12
